# Leetcode SQL question Solutions

# 176. Second Highest Salary

In [ ]:
select max(Salary) as SecondHighestSalary
from Employee
where salary < (select max(Salary) 
                from Employee );

# 584. Find Customer Referee

In [ ]:
select name from customer
 where referee_id  !='2' or referee_id is NULL

# 175. Combine Two Tables

In [ ]:
select   Person.FirstName, Person.LastName , city, State from Person
left join 
 Address ON Address.PersonId = Person.PersonId ;

# 577. Employee Bonus

In [ ]:
select name, bonus from Employee
left join
Bonus on Employee.empId = Bonus.empId
where bonus < 1000 or bonus is Null ;

# 1407. Top Travellers

In [ ]:
select name, COALESCE(SUM(distance),0) as travelled_distance 
from Users 
left join  Rides 
on Users.id = Rides.user_id 
group by name

ORDER BY travelled_distance  desc, name;

# 512. Game Play Analysis II

In [ ]:
select player_id,device_id from activity
where (player_id,event_date) in (select player_id,min(event_date) from activity group by player_id)

# 511. Game Play Analysis I

In [ ]:
select player_id,min(event_date) as first_login from activity group by player_id

# 177. Nth Highest Salary

In [ ]:
CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
BEGIN
  RETURN (
       select salary 
      from(select distinct salary, dense_rank() over(order by salary desc) as a
      from Employee
      ) as t
      where a=N
  );
END

# 1693. Daily Leads and Partners

In [ ]:
Select date_id ,make_name, count(distinct lead_id) as unique_leads   , count(distinct partner_id ) as  unique_partners
from DailySales
group by 1, 2;

# 181. Employees Earning More Than Their Managers

In [ ]:
select p.name as Employee from Employee e left join Employee p
on e.id = p.ManagerId
where e.Salary < p.salary  ;

# 180. Consecutive Numbers

In [ ]:
select distinct Num as ConsecutiveNums
from
(select Num, count(*)  as count_rep
from (select Logs.*,
             (row_number() over (order by id) -
              row_number() over (partition by Num order by id)
             ) as grp
      from Logs
     ) Logs
group by grp, Num) Logs

where count_rep >= 3 ;

OR

select distinct l1.Num as ConsecutiveNums
from 
Logs l1,
Logs l2,
Logs l3
where
l1.Id = l2.Id - 1
    AND l2.Id = l3.Id - 1
    AND l1.Num = l2.Num
    AND l2.Num = l3.Num
;

# 1303. Find the Team Size

In [ ]:
DELETE p1 FROM Person p1,
    Person p2
WHERE
    p1.Email = p2.Email AND p1.Id > p2.Id

# 1068. Product Sales Analysis I

In [ ]:
select product_name , year, price from Sales join Product on 
Sales. product_id =  Product.product_id;

# 1069. Product Sales Analysis II

In [ ]:
select  Sales.product_id , sum(quantity) as total_quantity 
from Sales join Product on
Sales.product_id =  Product.product_id
group by Sales.product_id;

# 1070. Product Sales Analysis III

In [ ]:
select r.product_id, r.year as first_year, r.quantity, r.price from 
(select product_id, year, quantity, price, 
dense_rank() over(partition by product_id order by year) as rank_year
from Sales) r
where r.rank_year = 1

# 1633. Percentage of Users Attended a Contest

In [ ]:
select contest_id, round(count(*)*100/(Select Count(*) From  Users),2) as percentage from Users
join Register on Users.user_id = Register.user_id
group by contest_id
order by percentage desc,contest_id

# 1517. Find Users With Valid E-Mails

In [ ]:
SELECT 
    user_id, name, mail
FROM
    users
WHERE
    mail REGEXP '^[a-zA-Z][a-zA-Z0-9_.-]*@leetcode.com$'

# 627. Swap Salary

In [ ]:
UPDATE salary
SET sex = CASE WHEN sex = 'm' THEN 'f' 
                  WHEN sex = 'f' THEN 'm'
                  end

# 585. Investments in 2016

In [ ]:
select sum(TIV_2016) as TIV_2016 from insurance
where TIV_2015 in
(select TIV_2015 from insurance
group by TIV_2015 
having count(*) > 1)

and concat( Lat, Lon) in 
(select concat( Lat, Lon) 
from insurance 
group by Lat, Lon
having count(*) = 1)

# 1251. Average Selling Price

In [ ]:
select Prices.product_id, round(sum(Prices.price* UnitsSold.units)/sum(UnitsSold.units),2) as average_price from
Prices left join UnitsSold on Prices.product_id = UnitsSold.product_id and UnitsSold.purchase_date between 
Prices.start_date and Prices.end_date 
group by Prices.product_id  ;

# 182. Duplicate Emails

In [ ]:
select email from
Person 
group by Email 
having count(*) >1

# 178 Rank Scores

In [ ]:
select score,
dense_rank() over(order by score desc) `Rank`
from (select score from Scores
order by score desc) r;

# 1699. Number of Calls Between Two Persons

In [ ]:
SELECT distinct  from_id  as person1, to_id as person2 ,  count(*) as call_count, sum(duration) as total_duration
FROM
    (
            SELECT from_id, to_id, duration
            FROM Calls
        UNION ALL
            SELECT to_id , from_id,duration 
            FROM Calls
    ) r
WHERE from_id <  to_id
group by from_id , to_id;

# 184. Department Highest Salary

In [ ]:
select  Department,Employee , Salary
from (select  Department,Employee , Salary,
dense_rank() over(partition by Department order by Salary  desc) ran
from 
(select d.Name as Department ,  e.Name as Employee , Salary from Employee e
left join Department d
on  e.DepartmentId = d.Id
order by Salary desc) r
) as sub_q

where sub_q.ran = 1 and Department is not null

# 1179. Reformat Department Table

In [ ]:
select
id,
sum(case when month = 'Jan' then revenue end) as Jan_Revenue,
sum(case when month = 'Feb' then revenue end) as Feb_Revenue,
sum(case when month = 'Mar' then revenue end) as Mar_Revenue,
sum(case when month = 'Apr' then revenue end) as Apr_Revenue,
sum(case when month = 'May' then revenue end) as May_Revenue,
sum(case when month = 'Jun' then revenue end) as Jun_Revenue,
sum(case when month = 'Jul' then revenue end) as Jul_Revenue,
sum(case when month = 'Aug' then revenue end) as Aug_Revenue,
sum(case when month = 'Sep' then revenue end) as Sep_Revenue,
sum(case when month = 'Oct' then revenue end) as Oct_Revenue,
sum(case when month = 'Nov' then revenue end) as Nov_Revenue,
sum(case when month = 'Dec' then revenue end) as Dec_Revenue
from Department
group by id

#  626. Exchange Seats

In [ ]:
SELECT
   s1.id, COALESCE(s2.student, s1.student) AS student
FROM
    seat s1
        LEFT JOIN
    seat s2 ON (s1.id+1)^1-1 = s2.id
ORDER BY s1.id;

# 1270. All People Report to the Given Manager

In [ ]:
select emp1 as employee_id from
(select emp1 , man1 , e3.manager_id  as man2 from
(select  e1.employee_id as emp1 , e2.manager_id  as man1 from
Employees e1  join Employees e2
on e1.manager_id = e2.employee_id) as t1 
join Employees e3
on man1 = e3.employee_id) as t2 

where man2 = 1 and emp1 != 1

# 185. Department Top Three Salaries

In [ ]:
select  Department,Employee , Salary
from (select  Department,Employee , Salary,
dense_rank() over(partition by Department order by Salary  desc) ran
from 
(select d.Name as Department ,  e.Name as Employee , Salary from Employee e
INNER join Department d
on  e.DepartmentId = d.Id
order by Salary desc) r
) as sub_q

where sub_q.ran < 4  and Department is not null;

# 262. Trips and Users

In [ ]:
SELECT
request_at Day,

    round(SUM(CASE 
            WHEN c.banned = 'No' AND d.banned = 'No' AND status LIKE('%cancelled%') THEN 1
            ELSE 0
        END)/SUM(CASE
                    WHEN c.banned = 'No' THEN 1 ELSE 0 END),2) 'Cancellation Rate'
FROM trips t
inner join Users c ON t.client_id = c.users_id and c.role = 'client'
inner join Users d ON t.driver_id = d.users_id and d.role = 'driver'
WHERE request_at BETWEEN '2013-10-01' AND '2013-10-03'
GROUP BY request_at
ORDER BY request_at
;

# 197. Rising Temperature

In [ ]:
SELECT t2.id FROM `Weather` t1, `Weather` t2
WHERE t2.Temperature > t1.Temperature
AND t2.recordDate = t1.recordDate + INTERVAL 1 DAY

# 183. Customers Who Never Order

In [ ]:
select Name as Customers from Customers left join Orders
on Orders.CustomerId = Customers.id
where CustomerId is Null

# 1173. Immediate Food Delivery I

In [ ]:
select round(count(*)*100/(select count(*) from Delivery),2) as immediate_percentage from Delivery
where order_date = customer_pref_delivery_date

# 1587. Bank Account Summary II

In [ ]:
select name ,balance from
(select name, sum(amount) as balance from Transactions join Users on Users.account =  Transactions.account
group by Transactions.account) as t
where balance > 10000

# 1350. Students With Invalid Departments

In [ ]:
select id , Students.name from Students 
where Students .department_id not in(
select Students.department_id from Students join Departments on Departments.id = Students.department_id)

In [ ]:
# 1212. Team Scores in Football Tournament

# 601. Human Traffic of Stadium

In [ ]:
select distinct A.*
from Stadium A inner join Stadium B inner join Stadium C
on (   (A.id+1 = B.id and A.id+2 = C.id)
     or (A.id-1 = B.id and A.id+1 = C.id)
     or (A.id-1 = B.id and A.id-2 = C.id) )
where A.people >= 100 and B.people >= 100 and C.people >= 100
order by A.id

or

select distinct t1.*
from stadium t1, stadium t2, stadium t3
where t1.people >= 100 and t2.people >= 100 and t3.people >= 100
and
(
    (t1.id - t2.id = 1 and t1.id - t3.id = 2 and t2.id - t3.id =1)  -- t1, t2, t3
    or
    (t2.id - t1.id = 1 and t2.id - t3.id = 2 and t1.id - t3.id =1) -- t2, t1, t3
    or
    (t3.id - t2.id = 1 and t2.id - t1.id =1 and t3.id - t1.id = 2) -- t3, t2, t1
)
order by t1.id
;

# 1412. Find the Quiet Students in All Exams

In [ ]:
select student.student_id, student.student_name from student
  join exam on exam.student_id = student.student_id
  join (select exam_id, min(score) lo, max(score) hi from exam group by exam_id) as exam_minmax on exam_minmax.exam_id = exam.exam_id
  group by student.student_id
  having min(case when score <> lo and score <> hi then 1 else 0 end) = 1
  order by student.student_id;

# 1158. Market Analysis I

In [ ]:
SELECT user_id as  buyer_id , join_date, ifnull(count(o.order_id),0) as orders_in_2019 
from Users u
left join Orders o on u.user_id = o.buyer_id and left(order_date,4) = '2019'
group by user_id, join_date

# 597. Friend Requests I: Overall Acceptance Rate

In [ ]:
select ifnull(round(count(distinct concat(requester_id, accepter_id))/(select  count(distinct concat(sender_id,send_to_id ))
 from FriendRequest),2),0) as accept_rate FROM RequestAccepted

In [ ]:
# 1435. Create a Session Bar Chart

# 1141. User Activity for the Past 30 Days I

In [ ]:
select activity_date as day, count(distinct user_id) as active_users from Activity
where activity_date  >= '2019-06-28' and activity_date <= "2019-07-27"
group by activity_date  ;

# 1241. Number of Comments per Post

In [ ]:
with sub as (
    select distinct sub_id as sub
    from Submissions
    where parent_id is null
)
select sub.sub as post_id, count(distinct s.sub_id) as number_of_comments
from sub left join Submissions s on sub.sub=s.parent_id
group by sub.sub
order by post_id

# 1084. Sales Analysis III

In [ ]:
select   t1.product_id, Product.product_name 
from
(select  product_id, sale_date,
sum(case when sale_date >="2019-01-01" and sale_date <= "2019-03-31" then 0 else 1 end ) as count1 
from Sales 
group by product_id ) as t1 
join Product on
t1.product_id = Product.product_id
where t1.count1 = 0

# 1083. Sales Analysis II

In [ ]:
select distinct buyer_id from Sales
join Product on Product.product_id = Sales.product_id
where buyer_id not in
(select buyer_id  from Sales
left join Product on Product.product_id = Sales.product_id
where  Product.product_name  = "iPhone") and Product.product_name= "S8"

# 620. Not Boring Movies

In [ ]:
select * from cinema 
where  id%2 != 0 and description != "boring"
order by rating desc

# 586. Customer Placing the Largest Number of Orders

In [ ]:
SELECT  customer_number
FROM 
(select customer_number, count(customer_number ) from orders
group by customer_number
order by count(*) desc) as t
 limit 1

# 1355. Activity Participants

In [ ]:
with ate as
(select a1.name ,count(f.name) as n from Activities a1
left join Friends f on f.activity  = a1.name
group by a1.name 
order by n desc)

select ate.name as ACTIVITY
FROM ate
where ate.n < (select max(n) from ate) and 
ate.n > (select MIN(n) from ate)

# 1454. Active Users

In [ ]:
WITH tab AS

(SELECT *, (DAYOFYEAR(Login_date) - DENSE_RANK() 
            OVER(PARTITION BY id ORDER BY login_date ASC)) AS diff

FROM Logins)

SELECT DISTINCT tab.id,
a.name

FROM tab JOIN Accounts a

ON tab.id = a.id

GROUP BY tab.id, tab.diff

HAVING COUNT(DISTINCT tab.login_date) >= 5;

# 1132. Reported Posts II

In [ ]:
WITH t1 AS(
    SELECT a.post_id, a.action_date, r.remove_date
    FROM Actions a LEFT JOIN Removals r
    USING(post_id)
    WHERE a.extra = "spam"
),

t2 AS(
    SELECT t1.action_date, 
 (COUNT(DISTINCT CASE WHEN remove_date IS NOT NULL THEN post_id ELSE NULL END)/COUNT(DISTINCT post_id)) AS rate
    FROM t1
    GROUP BY action_date
)

select ROUND(AVG(rate)*100,2) AS average_daily_percent 
from t2

# 1204. Last Person to Fit in the Elevator

In [ ]:
select  person_name 
from (select *, (SUM(weight) OVER(ORDER BY turn asc)) AS cumulative_sum
FROM Queue) s
where  s.cumulative_sum <= 1000
order by turn desc
LIMIT 1;

# 1174. Immediate Food Delivery II

In [ ]:
with t2 as (select *
from (select *, (DENSE_RANK() 
            OVER(PARTITION BY customer_id ORDER BY order_date ASC)) as r
from Delivery) t1
where r = 1) 

select round(sum( case when order_date = customer_pref_delivery_date then 1 else 0 end)*100/
(select count(*) from t2),2) immediate_percentage

from t2

# 1596. The Most Frequently Ordered Products for Each Customer

In [ ]:
with t1 as (select customer_id, product_id, count(product_id) as f
from Orders
group by customer_id, product_id )
,
t2 as (select customer_id ,t1.product_id, f, Products.product_name from t1 join Products on 
Products.product_id = t1.product_id)

select customer_id,product_id,product_name from (select *, (dense_rank() OVER(PARTITION BY customer_id ORDER BY f desc )) as s
from t2) t3
where s = 1

# 1212. Team Scores in Football Tournament

In [ ]:
WITH CTE AS(
Select host_team,guest_team, 
CASE WHEN host_goals>guest_goals  then 3
     WHEN host_goals=guest_goals then 1
     else 0 end as Host_Goals,
    
CASE WHEN host_goals<guest_goals  then 3
     WHEN host_goals=guest_goals then 1
     else 0 end as Guest_Goals 
     from Matches),
     
Team_As_Guest as(
Select distinct T.team_id, SUM(Guest_Goals) as Guest_pt FROM CTE RIGHT JOIN Teams T
    on T.team_id=CTE.guest_team
    where T.team_id=CTE.guest_team
    GROUP BY T.team_id
),

Team_As_Host as(
Select distinct T.team_id, SUM(Host_Goals) As Host_Pt FROM CTE RIGHT JOIN Teams T
    on T.team_id=CTE.host_team
    where T.team_id=CTE.host_team
    GROUP BY T.team_id
)
     
Select T.team_id,T.team_name, Coalesce(SUM(Guest_pt),0)+Coalesce(SUM(Host_Pt),0) as num_points from
Teams T LEFT JOIN Team_As_Host A 
on T.team_id=A.team_id LEFT JOIN Team_As_Guest B on
T.team_id=B.team_id
group by T.team_id
order by num_points desc, T.team_id

# 1543. Fix Product Name Format

In [ ]:
SELECT LOWER(TRIM(product_name)) AS product_name, 
       DATE_FORMAT(sale_date, "%Y-%m") AS sale_date, 
       COUNT(sale_id) AS total
FROM sales
GROUP BY 1, 2
ORDER BY product_name, sale_date

# 1565. Unique Orders and Customers Per Month

In [ ]:
select DATE_FORMAT( order_date , "%Y-%m") AS month, count(order_id ) as order_count
, count(distinct  customer_id  ) as customer_count 
from Orders
where invoice > 20
group by month

# 574. Winning Candidate

In [ ]:
select Name from Candidate right join  (select CandidateId, count(CandidateId) as c from Vote
group by CandidateId 
order by c desc
limit 1) t2
on Candidate.id = t2.CandidateId

# 612. Shortest Distance in a Plane

In [ ]:
select round(min(sqrt(pow(p1.x-p2.x,2)+pow(p1.y-p2.y,2))),2) as shortest
from point_2d p1, point_2d p2
where not (p1.x = p2.x and p1.y=p2.y);

 # 610. Triangle Judgement

In [ ]:
select x,y,z,
case when x>=y and x>=z and (y+z)>x then 'Yes'
when y>=x and y>=z and (x+z)>y then 'Yes'when z>=x and z>=y and (x+y)>z then 'Yes'
when x=y and x=z then 'Yes' else 'No' end as triangle from triangle;